{"status":200,"msg":"OK","result":[{"mMediaId":"CAT-ID-3-MED-ID-0","mMediaTitle":"Disney Eats","mMediaDescription":"Disney foodies rejoice… Disney Eats has arrived! The Disney Eats YouTube channel is a place to explore and celebrate the world of Disney food.\n \nWhether you’re looking for an Instagram-worthy lunch to make for your family, curious about the latest food craze from Tokyo Disney, or an aspiring chef who wants to cook the perfect Ratatouille – Disney Eats gives you access to a world of culinary adventure. \n \nCheck back every week to watch new Disney-inspired food videos featuring all of your favorite characters, including: Mickey Mouse and friends, Disney Villains, Disney Princesses, and characters from Disney•Pixar, Star Wars, and Marvel!","mMediaType":7,"mMediaLargeIcon":"https://yt3.ggpht.com/a/AATXAJw4uCKLoEcJgRLWghokPwkK-rvSPXMgiL9hyQ=s800-c-k-c0xffffffff-no-rj-mo","mMediaSource":{"mMediaSourceId":"UCgdpS0NYRwFewg-nBXWO98g","mSourceName":"","mSourceType":-1,"mSourceUrl":""},"mIsChildDirty":false,"mChildSource":"URTubeAppData/Home/MediaMetaData/Childs/ChildListFor-Media-CAT-ID-3-MED-ID-0.json"},{"mMediaId":"CAT-ID-3-MED-ID-1","mMediaTitle":"Mickey Mouse","mMediaDescription":"Enjoy animated and live action Disney cartoons and short films including the new Mickey Mouse Cartoons series. Plus be inspired by our favorites from other YouTube creators and across the web!","mMediaType":7,"mMediaLargeIcon":"https://yt3.ggpht.com/a/AATXAJwbyDzn7MD7a_VBL-NBSaakmIuX2KtEvtwRIQ=s800-c-k-c0xffffffff-no-rj-mo","mMediaSource":{"mMediaSourceId":"UC5K8SEF_7GQBedXIjtXLCRg","mSourceName":"","mSourceType":-1,"mSourceUrl":""},"mIsChildDirty":false,"mChildSource":"URTubeAppData/Home/MediaMetaData/Childs/ChildListFor-Media-CAT-ID-3-MED-ID-1.json"},{"mMediaId":"CAT-ID-3-MED-ID-2","mMediaTitle":"Disney Style","mMediaDescription":"Hey Guys!  Welcome to Disney Style!  This is your destination for Disney-inspired makeup and outfit tutorials, DIY projects, and all things Disney fashion. \n\nWatch Destination: Disney Style every Tuesday!  Featuring your faves LaurDIY, Meredith Foster, Jaleesa Moses and Lucy and Lydia.","mMediaType":7,"mMediaLargeIcon":"https://yt3.ggpht.com/a/AATXAJyMpod2H8v8U59J6IwdRad-y3J7tLIgb1hsRw=s800-c-k-c0xffffffff-no-rj-mo","mMediaSource":{"mMediaSourceId":"UCZSVJrC2Hnu92n2Lhez3KgA","mSourceName":"","mSourceType":-1,"mSourceUrl":""},"mIsChildDirty":false,"mChildSource":"URTubeAppData/Home/MediaMetaData/Childs/ChildListFor-Media-CAT-ID-3-MED-ID-2.json"},{"mMediaId":"CAT-ID-3-MED-ID-3","mMediaTitle":"Oh My Disney","mMediaDescription":"This is the official Oh My Disney channel. Videos for Disney lovers, by Disney lovers.  \nWe serve high levels of Disney magic. \nSubscribe for new videos every week! https://goo.gl/IeAGWe\n\nOh My Disney represents a unique opportunity for #Disney to re-tell our classic stories in a voice that speaks directly to you. #OhMyDisney delivers original and shareable content about classic and current Disney characters to fans through a variety of videos, GIFs, quizzes, and quippy editorial. Humor and heart come together in each piece of content created by the writing team. The editorial process is nimble enough to capture the zeitgeist of what is happening in the moment, yet is still entrenched in the classic Disney stories our fans have come to know and love throughout the years. Offer\n\n\nSee even more Oh My Disney:\n\nOh My Disney: http://ohmy.disney.com\nInstagram : http://www.instagram.com/ohmydisney/\nFacebook: http://facebook.com/ohmydisney\nSnapchat! @ ohmydisney","mMediaType":7,"mMediaLargeIcon":"https://yt3.ggpht.com/a/AATXAJzuUzd6DXWJdkIjyuKa_ckC8XuUWf7Ff1zo6g=s800-c-k-c0xffffffff-no-rj-mo","mMediaSource":{"mMediaSourceId":"UCbFnGyIcAhDrj-90OzvI7kw","mSourceName":"","mSourceType":-1,"mSourceUrl":""},"mIsChildDirty":false,"mChildSource":"URTubeAppData/Home/MediaMetaData/Childs/ChildListFor-Media-CAT-ID-3-MED-ID-3.json"},{"mMediaId":"CAT-ID-3-MED-ID-4","mMediaTitle":"Kids Channel - Cartoon Videos for Kids","mMediaDescription":"Kids Channel is an online educational platform, specializing in graphic videos, nursery rhymes and songs for children. With the help of colors and graceful movement children develop their cognitive capacities, imagination, creativity and logical reasoning. Taking preschool education to the next level our videos go beyond ABC, 123, shapes and colors we teach your preschooler moral values such as friendship, love, caring , sharing and more. Our videos bring to life the toys that your baby plays with such as cars, trucks, monster trucks and many more vehicles that bring kindergarten education to your door step, interactively teaching your toddler the alphabets, numbers and more. A land of car cartoons we have many special friends such as Little Red Car, the Haunted House Monster Truck, Monster Truck Dan and the Road Rangers take you to a special journey in each new episode. We are dedicated in nurturing young minds into young intellectuals. Let you children join the movement!","mMediaType":7,"mMediaLargeIcon":"https://yt3.ggpht.com/a/AATXAJweHWw3096xvbtp-YoUC1j4MUeHJjsdfJqEdQ=s800-c-k-c0xffffffff-no-rj-mo","mMediaSource":{"mMediaSourceId":"UC3KknIJZXRygH2pZ6MDtGbg","mSourceName":"","mSourceType":-1,"mSourceUrl":""},"mIsChildDirty":false,"mChildSource":"URTubeAppData/Home/MediaMetaData/Childs/ChildListFor-Media-CAT-ID-3-MED-ID-4.json"},{"mMediaId":"CAT-ID-3-MED-ID-5","mMediaTitle":"Disney Junior","mMediaDescription":"You're watching Disney Junior! Check out exclusive content that super fans of Mickey Mouse, T.O.T.S, Puppy Dog Pals, Mira, Royal Detective, the Muppet Babies, PJ Masks, Blue, Vampirina, Fancy Nancy, Doc McStuffins, Elena of Avalor, Disney Junior Nursery Rhymes, The Rocketeer, Gigantosaurus, and more will enjoy!\n\nKeep up with our new videos here: https://www.youtube.com/playlist?list=PL2m1vjiMH_hNEEv_Kr3YN30D-CktoOCU0\n\nAnd watch full episodes on DisneyNOW! Download the app or watch it on www.DisneyNow.com","mMediaType":7,"mMediaLargeIcon":"https://yt3.ggpht.com/a/AATXAJwmFFHa3opx2ZeTw2UMoz7tYu26gggetqKGNg=s800-c-k-c0xffffffff-no-rj-mo","mMediaSource":{"mMediaSourceId":"UCNcdbMyA59zE-Vk668bKWOg","mSourceName":"","mSourceType":-1,"mSourceUrl":""},"mIsChildDirty":true,"mChildSource":"URTubeAppData/Home/MediaMetaData/Childs/ChildListFor-Media-CAT-ID-3-MED-ID-5.json"}]}