{"status":200,"msg":"OK","result":[{"mMediaId":"CAT-ID-0-MED-ID-0","mMediaTitle":"Learn to Wash Your Hands, Tie Your Shoes, Exercise, and more! | Ready for Preschool | Disney Junior","mMediaDescription":"Learn to wash your hands, tie your shoes, brush your teeth, and more with some help from your favorite Disney Junior friends! \n\nShorts Included:\nEverybody Wash Your Hands\nLet’s Make a Bow\nLet’s Exercise\nI Brush My Teeth\nGood Food\nClean\nPajama Bed Time\n\nWatch Ready for Preschool on Disney Junior and in DisneyNOW! And check out more Ready for Preschool videos here: https://www.youtube.com/playlist?list=PL2m1vjiMH_hMn6TFBGQsxe9ysHNnuBlKE\n\nJoin us for a season of fun playful tunes with our favorite Disney characters that prepares young minds for Preschool!\n\n#readyforpreschool #disneyjunior","mMediaType":0,"mMediaLargeIcon":"https://i.ytimg.com/vi/QvshlJpTn5I/hqdefault.jpg","mMediaSource":{"mMediaSourceId":"QvshlJpTn5I","mSourceName":"","mSourceType":-1,"mSourceUrl":""},"mIsChildDirty":false},{"mMediaId":"CAT-ID-0-MED-ID-1","mMediaTitle":"The Lion Guard - Kion Uses His Roar | Official Disney Junior Africa","mMediaDescription":"Is your little one ready to join the adventures of Kion and The Lion Guard in their mission to protect the Pridelands?\n\n\nWelcome to the official Disney Channel Africa YouTube channel! Here you can find all the latest show clips, watch music videos, go behind the scenes and learn how to get the look with tutorial videos featuring some of our Disney Channel stars! \n\nCatch BRAND NEW content and re-watch the best bits from some of your favourite shows including Elena of Avalor, Tales of Miraculous Ladybug and Cat Noir, The ZhuZhus, The Lodge, Bizaardvark and Stuck in the Middle. You can also find out about all the exciting things we have coming up each month on Disney Channel, available exclusively on DStv channel 303.\n \nFor more exclusive Disney Channel news and gossip, like us on Facebook - https://www.facebook.com/DisneyinAfrica\n \nCheck out the latest from Disney XD Africa YouTube here - https://www.youtube.com/user/disneyxdza","mMediaType":0,"mMediaLargeIcon":"https://i.ytimg.com/vi/sl9nFX992pY/hqdefault.jpg","mMediaSource":{"mMediaSourceId":"sl9nFX992pY","mSourceName":"","mSourceType":-1,"mSourceUrl":""},"mIsChildDirty":false},{"mMediaId":"CAT-ID-0-MED-ID-2","mMediaTitle":"Jungle Book | Hindi Kahaniya | Episode  | Animation Cartoon | Power Kids","mMediaDescription":"The Jungle Book Cartoon Show for all its fans in amazing 3D Animation and special effects.Make sure to Like, Share and Subscribe to the Channel Power Kids for more exciting episodes and shows. \n\nThe Jungle book follows the adventures of the Man-Cub Mowgli, who has been raised in the Jungles of India by wild animals. He grows and explores the world with his animal friends Baloo, the wise Bear, Bagheera, his Panther friend, and Kaa, the lazy Rock-Python!\n\nThis Jungle Book cartoon TV series has been directed by Music by Guy Michelmore. Written by Jimmy Hibbert & story board by Christian Choquet. \n\n Watch some of the most exciting cartoons like Charlie Chaplin, Jungle Book, Robin Hood, Peter Pan, Casper, Lassie, Little Prince, Le Petit Prince, Twisted Whiskers, Maryoku Yummy, Pet Pals, Little Nick, Le Petit Nicola, And Yet It Moves, Sandra and many many more! \n\nMore fun @\nhttps://twitter.com/DQEWorld  \nhttps://www.facebook.com/DQEWorld\nhttp://bit.ly/dqeworld","mMediaType":0,"mMediaLargeIcon":"https://i.ytimg.com/vi/t4NbHBSRs0E/hqdefault.jpg","mMediaSource":{"mMediaSourceId":"t4NbHBSRs0E","mSourceName":"","mSourceType":-1,"mSourceUrl":""},"mIsChildDirty":false},{"mMediaId":"CAT-ID-0-MED-ID-3","mMediaTitle":"Jungle Book | Hindi Kahaniya | Mega Episode - 77 | Animation Cartoon | Power Kids","mMediaDescription":"#JungleBook #HindiKahaniya #PowerKids \n\nThe Jungle Book Cartoon Show is for all its fans in amazing 3D Animation and special effects only in Power Kids in Hindi. Enjoy this Mega Episode of full-on entertainment with all their favorite cartoon characters like only in Power Kids in Hindi. Mowgli, Baloo, Sheer Khan and many more. \nMake sure to Like, Share and subscribe to the Channel Power Kids for more exciting episodes and shows. \nThe Jungle book follows the adventures of the Man-Cub Mowgli, who has been raised in the Jungles of India by wild animals. He grows and explores the world with his animal friends Baloo, the wise Bear, Bagheera, his Panther friend, and Kaa, the lazy Rock-Python! This Jungle Book cartoon TV series has been directed by Music by Guy Michelmore. Written by Jimmy Hibbert & storyboard by Christian Choquet. Power Kids is the destination for cartoons, animation, shows, games, contests, merchandise and a whole lot of fun stuff! Watch some of the most exciting cartoons like Jungle Book, Robin Hood, Peter Pan and many more! \nMore fun @\nhttps://www.instagram.com/powerrkids/\nhttps://twitter.com/DQEWorld \nhttps://www.facebook.com/DQEWorld\nhttp://bit.ly/dqeworld","mMediaType":0,"mMediaLargeIcon":"https://i.ytimg.com/vi/CejWWHLQ2fY/hqdefault.jpg","mMediaSource":{"mMediaSourceId":"CejWWHLQ2fY","mSourceName":"","mSourceType":-1,"mSourceUrl":""},"mIsChildDirty":false},{"mMediaId":"CAT-ID-0-MED-ID-4","mMediaTitle":"BIG HULK VS SPIDERMAN - THE INCREDIBLE HULK VS SPIDER-MAN (2002)","mMediaDescription":"BIG HULK VS SPIDERMAN - THE INCREDIBLE HULK VS SPIDER-MAN (2002)\n\nThe epic superheroes battle between Big Hulk vs Spiderman takes place in Grand Theft Auto V\n\nSpider-Man is a 2002 American superhero film directed by Sam Raimi and written by David Koepp.\n\nBased on the fictional Marvel Comics character Spider-Man, the film stars Tobey Maguire as Peter Parker, a high-school student who turns to crimefighting after developing spider-like powers. Spider-Man also stars Willem Dafoe as Norman Osborn (a.k.a. the Green Goblin), Kirsten Dunst as Peter's love interest, Mary-Jane Watson, and James Franco as his best friend, Harry Osborn. \n\nHulk (Doctor Robert Bruce Banner) is a renowned scientist in the fields of Biochemistry, Nuclear Physics, and Gamma Radiation. Hulk is one of the scientists who tried to recreate the Super Soldier Serum which originated Captain America in World War II, but when an exposure to high levels of Gamma Radiation instead of Vita Radiation went awry, the mild-mannered scientist found himself plagued with a peculiar condition; when angered or provoked, hulk would transform into the rage-fueled and nearly mindless green-skinned monster known as the Hulk. \n\nBig Hulk is created by modder Barak101\n\nSpider-Man (2002) is created by modder Meth0d\n\nThanks for watching\n\nLeave a comment on what battle you would like to see and dont forget to subscribe to my channel for more battles :)\n\nBe sure to check out other epic battles between superheroes:\n\nhttp://www.youtube.com/playlist?list=PL0IC2jPAhnRIHT65FIODGROZhXgppETdy\n\n★ Hulk vs Spiderman (Civil War)\nhttps://youtu.be/TCFbmE3Fmks\n\n★ Spiderman vs Hulk\nhttps://youtu.be/wKsE7RGP_VY\n\n★ Ultimate Spiderman vs Hulk\nhttps://youtu.be/qBA-j_4ZByg\n\n★ Hulk vs Spiderman Enemies\nhttps://youtu.be/JzSS7D4WYs4\n\n★ The Incredible Hulk vs Spiderman\nhttps://youtu.be/4-Rf_hfnmrA\n\n\nScript by JulioNIB:\nhttp://gtaxscripting.blogspot.com/\n\nAll mods are available at \n\nhttp://gta5-mods.com\n\nFacebook: http://facebook.com/kiragaming","mMediaType":0,"mMediaLargeIcon":"https://i.ytimg.com/vi/KF4hH8wUXWw/hqdefault.jpg","mMediaSource":{"mMediaSourceId":"KF4hH8wUXWw","mSourceName":"","mSourceType":-1,"mSourceUrl":""},"mIsChildDirty":false}]}