{"status":200,"msg":"OK","result":[{"mMediaId":"CAT-ID-6-MED-ID-0","mMediaTitle":"Super Truck - Car City","mMediaDescription":"Super Truck to the rescue!\nMeet Carl the Super Truck, a superhero dedicated to protecting the town of Car City. Always ready to jump in and rescue a fellow inhabitant in trouble, he has the ability to transform into any type of vehicle. From Super Fire Truck to Super Boat, and with the help of his super-gadget the ST3000, Carl can solve any problem. \nWhenever an inhabitant is in trouble, Carl shifts into Super Truck and decides in which vehicle he should transform into to save his friends. \nFull of resources, Carl shows younger ones that with courage and perseverance, they can solve any problem! \nFrom Super Excavator to Super Helicopter or Super Dump Truck, Carl can transform into a multitude of vehicles to save the day! \nMeet also Amber the Ambulance, Ben the Tractor, Edna the Excavator, Marley the Monster Truck and many of the other residents that populate Car City. With distinctive personalities and abilities, they all happily live and work together.\nCartoon for kids !","mMediaType":7,"mMediaLargeIcon":"https://yt3.ggpht.com/a/AATXAJw2mCN16oiXKQSQ2SyPVzM7sYE9cVwI9cceUQ=s800-c-k-c0xffffffff-no-rj-mo","mMediaSource":{"mMediaSourceId":"UC-PrBbBlScO9CmH_51fXqhQ","mSourceName":"","mSourceType":-1,"mSourceUrl":""},"mIsChildDirty":false,"mChildSource":"URTubeAppData/Channels/MediaMetaData/Childs/ChildListFor-Media-CAT-ID-6-MED-ID-0.json"},{"mMediaId":"CAT-ID-6-MED-ID-1","mMediaTitle":"Super Cars Cartoon","mMediaDescription":"Welcome to \"Super Cars Cartoon\" YouTube channel. Here you can see cartoons with Learning colors and Numbers 3d animation.\nHere you can see superheros: Spiderman,Hulk, Lightning McQueen,Venom and others.\n3d animaion movies for kids with cars ! =)\n\nSubscribe to get more funny and good videos and cartoons.","mMediaType":7,"mMediaLargeIcon":"https://yt3.ggpht.com/a/AATXAJy1f4jnRwovZm94voMGq3ab0-jN1K3lZh4TMg=s800-c-k-c0xffffffff-no-rj-mo","mMediaSource":{"mMediaSourceId":"UCmKy_mpl8mCDDTTg96d7mhw","mSourceName":"","mSourceType":-1,"mSourceUrl":""},"mIsChildDirty":false,"mChildSource":"URTubeAppData/Channels/MediaMetaData/Childs/ChildListFor-Media-CAT-ID-6-MED-ID-1.json"},{"mMediaId":"CAT-ID-6-MED-ID-2","mMediaTitle":"Tiki Taki Cars","mMediaDescription":"Welcome to the best cartoons channel for kids - TIKI TAKI CARS! Here you can watch long cartoons about all the kinds of cars: Monster Trucks, Trucks, Garbage Trucks, Excavators, Tow Trucks and Tractors, Police cars, Fire Trucks, Bulldozers and many others. Series of 20 + Minutes, every day updates. Funny cars compilations. Enjoy the colorful, bright, interesting and super positive kids friendly cartoons. We care about your child and will do our best to make him happy. Enjoy new cartoons every day. Subscribe and leave your comments to improve our work. Have a nice time on our channel.","mMediaType":7,"mMediaLargeIcon":"https://yt3.ggpht.com/a/AATXAJwoay7bMOX-V7PcJVHJ-auv_fzeWE88jEcuOQ=s800-c-k-c0xffffffff-no-rj-mo","mMediaSource":{"mMediaSourceId":"UCzLnRpsdIXKwpS79HhqZuCA","mSourceName":"","mSourceType":-1,"mSourceUrl":""},"mIsChildDirty":false,"mChildSource":"URTubeAppData/Channels/MediaMetaData/Childs/ChildListFor-Media-CAT-ID-6-MED-ID-2.json"},{"mMediaId":"CAT-ID-6-MED-ID-3","mMediaTitle":"Monster Truck TV","mMediaDescription":"Welcome to the best cartoons channel for kids! Here you can watch cartoons about all the kinds of cars: Monster Trucks, Trucks, Garbage Trucks, Excavators, Tow Trucks and Tractors, Police cars, Fire Trucks, Bulldozers and many others. Enjoy the colorful, bright, interesting and super positive kids friendly cartoons. We care about your child and will do our best to make him happy. Enjoy new cartoons every day. Subscribe and leave your comments to improve our work.","mMediaType":7,"mMediaLargeIcon":"https://yt3.ggpht.com/a/AATXAJxbkpR-O_nVp9lqC6S4oAJMh3Fkn1nXngbeGA=s800-c-k-c0xffffffff-no-rj-mo","mMediaSource":{"mMediaSourceId":"UC3qOjb42eXq-RPHIekokh1Q","mSourceName":"","mSourceType":-1,"mSourceUrl":""},"mIsChildDirty":true,"mChildSource":"URTubeAppData/Channels/MediaMetaData/Childs/ChildListFor-Media-CAT-ID-6-MED-ID-3.json"}]}